; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	spectrograph2 - mode
	infrared5 - mode
	infrared3 - mode
	spectrograph4 - mode
	thermograph6 - mode
	spectrograph1 - mode
	image0 - mode
	GroundStation0 - direction
	Star3 - direction
	Star2 - direction
	Star1 - direction
	GroundStation4 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image0)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star3)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared5)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star1)
	(supports instrument6 thermograph6)
	(supports instrument6 image0)
	(calibration_target instrument6 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star1)
	(supports instrument8 spectrograph4)
	(supports instrument8 infrared3)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 image0)
	(supports instrument9 spectrograph4)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet11)
)
(:goal (and
	(have_image Star5 infrared3)
	(have_image Star5 infrared5)
	(have_image Planet6 image0)
	(have_image Planet6 infrared3)
	(have_image Phenomenon7 spectrograph4)
	(have_image Phenomenon8 infrared5)
	(have_image Star9 thermograph6)
	(have_image Star9 image0)
	(have_image Phenomenon10 spectrograph1)
	(have_image Phenomenon10 infrared3)
	(have_image Planet11 spectrograph2)
	(have_image Planet11 thermograph6)
	(have_image Phenomenon12 spectrograph1)
))

)

; plan
1. (turn_to satellite3 groundstation4 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 groundstation4)
   goals met: 0 of 13
2. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 0 of 13
3. (calibrate satellite3 instrument9 groundstation4)
   added: (calibrated instrument9)
   goals met: 0 of 13
4. (turn_to satellite3 planet11 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 planet11)
   goals met: 0 of 13
5. (take_image satellite3 planet11 instrument9 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 1 of 13
6. (turn_to satellite3 phenomenon7 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon7)
   goals met: 1 of 13
7. (turn_to satellite2 star2 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star2)
   goals met: 1 of 13
8. (turn_to satellite1 star2 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star2)
   goals met: 1 of 13
9. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   goals met: 1 of 13
10. (take_image satellite3 phenomenon7 instrument9 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 2 of 13
11. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 13
12. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 13
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 13
14. (calibrate satellite2 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 2 of 13
15. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 2 of 13
16. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 2 of 13
17. (turn_to satellite0 phenomenon10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 13
18. (take_image satellite0 phenomenon10 instrument0 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 3 of 13
19. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   goals met: 3 of 13
20. (take_image satellite0 planet6 instrument0 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 4 of 13
21. (turn_to satellite0 star5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star5)
   goals met: 4 of 13
22. (take_image satellite0 star5 instrument0 infrared3)
   added: (have_image star5 infrared3)
   goals met: 5 of 13
23. (turn_to satellite1 phenomenon8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon8)
   goals met: 5 of 13
24. (take_image satellite1 phenomenon8 instrument3 infrared5)
   added: (have_image phenomenon8 infrared5)
   goals met: 6 of 13
25. (turn_to satellite1 star5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star5)
   goals met: 6 of 13
26. (take_image satellite1 star5 instrument3 infrared5)
   added: (have_image star5 infrared5)
   goals met: 7 of 13
27. (turn_to satellite2 phenomenon10 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon10)
   goals met: 7 of 13
28. (take_image satellite2 phenomenon10 instrument4 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 8 of 13
29. (turn_to satellite2 phenomenon12 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon12)
   goals met: 8 of 13
30. (take_image satellite2 phenomenon12 instrument4 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 9 of 13
31. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 9 of 13
32. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 9 of 13
33. (turn_to satellite2 star1 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star1)
   goals met: 9 of 13
34. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 9 of 13
35. (turn_to satellite2 planet11 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet11)
   goals met: 9 of 13
36. (take_image satellite2 planet11 instrument6 thermograph6)
   added: (have_image planet11 thermograph6)
   goals met: 10 of 13
37. (turn_to satellite2 planet6 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet6)
   goals met: 10 of 13
38. (take_image satellite2 planet6 instrument6 image0)
   added: (have_image planet6 image0)
   goals met: 11 of 13
39. (turn_to satellite2 star9 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star9)
   goals met: 11 of 13
40. (take_image satellite2 star9 instrument6 image0)
   added: (have_image star9 image0)
   goals met: 12 of 13
41. (take_image satellite2 star9 instrument6 thermograph6)
   added: (have_image star9 thermograph6)
   goals met: 13 of 13
